In [2]:
# pip install Faker

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: Faker in c:\users\djedjiga\appdata\roaming\python\python313\site-packages (37.5.3)
Requirement already satisfied: tzdata in c:\programdata\anaconda3\lib\site-packages (from Faker) (2025.2)
Note: you may need to restart the kernel to use updated packages.

In [7]:
import pandas as pd 
import numpy as np
import random 
from faker import Faker

In [8]:
fake= Faker()
print(fake.name())
print(fake.address())

Julie Washington
PSC 9654, Box 7882
APO AP 85138

In [11]:
n=100
rollno= list(range(1, n))

In [13]:
n=1000
rollno=list( range(1, n))
sname= tuple(fake.name()for _ in rollno)
genders_set={'Male' , 'Female'}
gender= [random.choice(list(genders_set)) for _ in rollno]
courses_dict= {1: 'CS', 2: 'IT', 3: 'AI', 4: 'DS'}
course=[courses_dict[random.randint(1, 4)] for _ in rollno]
age=np.random.randint(18, 25, size= len(rollno))
df2=pd.DataFrame({'rollno':rollno, 'sname':sname, 'gender':gender, 'course':course, 'age':age})

In [15]:
df2=pd.DataFrame({'rollno':rollno, 'sname':sname, 'gender':gender, 'course':course, 'age':age})
df2.shape

(999, 5)

In [17]:
df2.head()

   rollno               sname  gender course  age
0       1       Jeffrey Stone    Male     AI   20
1       2  Christopher Galvan  Female     DS   19
2       3  Christopher Burton  Female     AI   24
3       4          Eric Lopez    Male     CS   22
4       5      Amber Reynolds    Male     DS   24

In [18]:
df2.tail()

     rollno          sname gender course  age
994     995   Justin Perez   Male     AI   23
995     996   Thomas Adams   Male     IT   23
996     997  Patrick Clark   Male     IT   22
997     998    April Irwin   Male     AI   19
998     999  Michael Green   Male     CS   18

In [28]:
df2.to_csv('C:/analytics/data/student08232025.csv', index= False)